/* Двумерные массивы
В пятиборье участвуют 10 спортсменов (define n 10). Информация о результатах пятиборья представлена в виде таблицы.
Строки - оценки по 10 бальной системе соответствующего спортсмена. Информация представлена массивом, размер котого 10х5. 
Необходимо для каждого спортсмена выдать среднюю арифметическую оценку, полученную им по всем видам пятиборья.

Дополнительно указать номер спортсмена у которого наивысшая средняя оценка.
Дополнительно использовать динамический двухмерный массив с необходимым количеством спортсменов.

Как будет выглядеть динамический двухмерный массив? 
- динамический одномерный массив с хитрой индексацией
- либо массив массивов (вроде здесь он)
*/
